app/Controllers/BookController.php

INSERT INTO `books` (`ProductName`, `Description`, `Price`, `Category`, `Brand`, `QuantityInStock`) VALUES ('qửegs', 'ret', '54', 'ưetwe', 'ưet', '345')
---

        $book = new Book();

        if ($book->insert($data)) {

UPDATE `books` SET `ProductName` = 'Harry Potter và Hòn Đá Phù Thủy 22', `Description` = ' Cuốn sách đầu tiên trong loạt truyện nổi tiếng của J.K. Rowling, mô tả về cuộc phiêu lưu của cậu bé phù thủy Harry Potter', `Price` = '19.99', `Category` = 'Tiểu thuyết', `Brand` = 'Bloomsbury Publishing', `QuantityInStock` = '120'
WHERE `books`.`id` IN ('1')
---
            return view('admin/u_b/edit_book', $display);
        } else {
            // Dữ liệu hợp lệ, tiến hành cập nhật dữ liệu vào cơ sở dữ liệu
            $book_update->update($update_id, $data);